sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getRecordCountForModule.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getRecordCountForModule">
   <soapenv:Header/>
    <soapenv:Body>
        <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>
        <sug:session>qs6p7jq73df88dpvggrgmk4e15</sug:session>    	   
    	   <sug:module>Accounts</sug:module>
    	   <sug:query>accounts.name like '%Test%'</sug:query>
    	   <sug:deleted>1</sug:deleted>    	  
   </soapenv:Body>
</soapenv:Envelope>